# Операции с целыми числами
##### Бинарные операторы (есть левый и правый операнды)
print(2 + 5)
print(2 - 5)
print(2 * 5)
print(20 / 5)
print(24536435654 * 5534534534)
print(2 + 5 * 4)
print(3 * 7, (17 - 2) * 8 , 4 / 3) # Вывод в одной строке
print((2 + 5) * 4) # Приоритет в выполнении операций
print(11111 * 1111111)
print(77 / 2) # Деление с дробью
print(40 // 8) # Целочисленное деление
print(42 // 8) # Целочисленное деление
print(42 % 8) # Остаток от деления
# Ошибка деления на ноль print(42 / (4 + 2 * (-2))) 
# Ошибка деления на ноль print(5 // 0)
print(239 % 10) # Остаток от деления
print(2 ** 5) # Возведение в степень
print(2014 ** 14) # Возведение в степень
##### Унарные операторы
print(-42)
print(+42)
print(--42)
print(+-+42)
# Синтаксическая ошибка print(-*42)
# Синтаксическая ошибка print(5 // 0)
