# Перечисление символов строки с помощью индексов
genome = 'ATGG'
for i in range (4):
    print (genome[i])

#
# Перечисление символов строки с помощью индексов
genome = 'ATGG'
for i in range (2,3):
    print (genome[i])

#
# Перечисление символов строки с помощью ЦИКЛА
genome = 'ATGG'
for i in genome:
    print (i)

#
# Дана геномная последовательность. Вывести, сколько раз в ней встречается нуклеотид цитозин -(C)
# Входные данные: CACCTGGAC
a = 'CACCTGGAC'
n = 0
for i in a:
    if i == 'C':
        n += 1
print (n)

#
# Дана геномная последовательность. Вывести, сколько раз в ней встречается нуклеотид цитозин -(C)
# Входные данные: CACCTGGAC
# РЕШЕНИЕ С ПОМОЩЬЮ МЕТОДА (ФУНКЦИИ) СТРОКИ
a = 'CACCTGGAC'
print(a.count('C'))


# МЕТОДЫ СТРОК:
# Дано: s = 'aTGcc'
#        p = 'cc'
# s.upper()  ---> 'ATGCC'
# s.lower()  ---> 'atgcc'
# s.count(p) ---> 1 (Сколько раз p встречается в s в неперекрывающемся виде)
# s.find(p)  ---> 3 (номер первого вхождения (индекс) p в s) 0123
# s.find('A')  ---> -1 (Строка 'A' не входит в s)
#                   проверка вхождения в строку:
#                   if 'TG' in s: ...
#                   но можно проверять и так:
#                   if s.find('A') == -1: ...
# s.replace('c', 'C') ---> 'aTGCC' (Заменяем все вхождения 'c' на 'C')

#
# Последовательные вызовы методов
s = 'agTtcAGtc'
print (s.upper().count('GT'))
print (s.upper().count('gt'.upper())) # Запись равносильна верхней

#
# Напишите программу, которая вычисляет процентное содержание символов G (гуанин) и C (цитозин) в введенной строке
# (программа не должна зависеть от регистра вводимых символов).
genome = input('Введите геномную последовательность: ')
lgenome=(genome.lower())
dlina = len(lgenome)
ccnt = lgenome.count('c')
gcnt = lgenome.count('g')
procent = (ccnt + gcnt) / dlina * 100
print(procent)

#
# Решение задачи в три строки
c = input().upper()
b=c.count('C')+c.count('G')
print((b/len(c))*100)

#
# Решение задачи в одну строку
[print((n.count('c') + n.count('g')) / len(n) * 100) for n in [input().lower()]]
